In [170]:
import pandas as pd
import numpy as np

In [171]:
#任务1:将列表转化为Numpy数组
data0 = [2, 4, 6.5, 8]
arr0 = np.array(data0)

In [172]:
#任务二：新建padans中的Series数据类型，打印出其大小、索引值、值

In [173]:
#pandas中的series数据类型
s=pd.Series(data=[100,'a',{'dic1':5}],
            index=pd.Index(['id1',20,'third'],name='my_idx'),
            dtype='object',
            name='my_name')

In [174]:
s2=pd.Series(["1","2","3","4"])

In [175]:
s2.index.values

array([0, 1, 2, 3], dtype=int64)

In [176]:
type(s2.values[0])

str

In [177]:
s2.shape[0]

4

In [178]:
s2.size

4

In [179]:
#任务3:创建DataFrame类型的数据，并获取其索引值、值及表大小
d={
    "one":pd.Series([1.0,2.0,3.0],index=["a","b","c"]),
    "two":pd.Series([1.0,2.0,3.0,4.0],index=["a","b","c","d"])
}
df=pd.DataFrame(d)

In [180]:
d1={
    "作者":pd.Series(['余华','残雪','莫言']),
    "作品":pd.Series(['活着','暗夜','红高粱']),
    "价格":pd.Series(['36','72','38'])
}
df2=pd.DataFrame(d1)

In [181]:
df2.index.values

array([0, 1, 2], dtype=int64)

In [182]:
df2.shape

(3, 3)

In [183]:
df2.size

9

In [184]:
df2['作品']

0     活着
1     暗夜
2    红高粱
Name: 作品, dtype: object

In [185]:
df2[['作者','价格']]

   作者  价格
0  余华  36
1  残雪  72
2  莫言  38

In [186]:
df2.values

array([['余华', '活着', '36'],
       ['残雪', '暗夜', '72'],
       ['莫言', '红高粱', '38']], dtype=object)

In [187]:
贵州茅台原始数据=pd.read_csv(R'data\600519.csv')

In [188]:
#按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [189]:
#按行查询数据
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [190]:
贵州茅台=贵州茅台原始数据.set_index('day')

In [191]:
#loc索引器
贵州茅台.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [192]:
贵州茅台.loc["2001-08-27",["open","close"]]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [193]:
贵州茅台.loc["2001-10-08",["open","close"]]

open     37.00
close    36.58
Name: 2001-10-08, dtype: float64

In [194]:
贵州茅台.loc['2001-08-27':'2001-10-08']

            STOCK_CODE   open  close  maximum  minimum  volume    TURNOVER
day
2001-08-27     6005191  34.51  35.55    37.78    32.85  406318  1410347008
2001-08-28     6005191  34.99  36.86    37.00    34.61  129647   463463008
2001-08-29     6005191  36.98  36.38    37.00    36.10   53252   194689000
2001-08-30     6005191  36.28  37.10    37.51    36.00   48013   177558000
2001-08-31     6005191  37.15  37.01    37.62    36.80   23231    86231000
2001-09-03     6005191  37.20  36.99    37.57    36.85   22112    82129000
2001-09-04     6005191  37.01  37.46    38.08    36.88   37006   139204000
2001-09-05     6005191  37.61  37.44    37.92    37.21   26066    97796000
2001-09-06     6005191  37.35  36.70    37.47    36.51   28997   107078000
2001-09-07     6005191  36.50  35.68    36.95    35.65   31552   113868000
2001-09-10     6005191  35.40  36.70    36.85    35.01   18878    68406000
2001-09-11     6005191  36.80  36.29    36.95    36.20   11390    41579000
2001-09-12     6005191  35.33  35.98    36.20    35.30   25045    89421000
2001-09-13     6005191  36.01  35.89    36.30    35.70   10986    39512000
2001-09-14     6005191  36.01  36.30    36.50    35.80    7672    27740000
2001-09-17     6005191  36.08  35.84    36.29    35.50    8983    32183000
2001-09-18     6005191  35.88  36.25    36.55    35.85   10773    39006000
2001-09-19     6005191  36.30  36.92    36.92    36.06    8650    31597000
2001-09-20     6005191  36.90  36.61    37.05    36.50   11173    41189000
2001-09-21     6005191  36.28  36.06    36.60    36.00    7879    28638000
2001-09-24     6005191  36.06  36.05    36.39    36.00    4068    14703000
2001-09-25     6005191  36.28  36.23    36.54    36.05    3488    12639000
2001-09-26     6005191  36.11  36.08    36.48    36.00    4956    17892000
2001-09-27     6005191  36.08  36.70    36.98    36.00    8778    32085000
2001-09-28     6005191  36.90  37.09    37.20    36.50   17088    63169000
2001-10-08     6005191  37.00  36.58    37.18    36.25    6552    24091000

In [195]:
条件1=贵州茅台['open']<35
条件2=贵州茅台['close']<35
布尔列表=条件1&条件2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [196]:
#使用函数作为索引
def condition(pd):
    条件1=贵州茅台['open']<35
    条件2=贵州茅台['close']<35
    布尔列表=条件1&条件2
    return 布尔列表

In [197]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [198]:
贵州茅台.query('open<35and close<35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [199]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2005-12-16     6005191   42.80   43.47    43.66    42.50    6671    28659038
2001-12-18     6005191   35.48   35.90    35.96    35.10    4821    17167382
2017-07-14     6005191  456.25  456.41   458.76   453.05   17727   806510272
2003-01-16     6005191   26.81   27.11    27.15    26.66    7359    19870062
2013-07-10     6005191  191.21  193.84   194.10   188.89   33245   635969696
2001-10-25     6005191   35.70   34.88    35.80    34.86   16036    56527000
2006-01-19     6005191   46.78   46.08    46.80    45.77    7283    33651491
2006-02-22     6005191   58.35   58.70    59.00    58.00   10335    60384853
2007-04-17     6005191  102.00   98.69   103.44    97.00   44619   442356320
2017-08-29     6005191  493.02  489.44   494.88   488.01   25177  1234431712

In [200]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [202]:
贵州茅台.describe()

,STOCK_CODE,open,close,maximum,minimum,volume,TURNOVER
count,4094.0,4094.000000,4094.000000,4094.000000,4094.000000,4094.000000,4.094000e+03
mean,6005191.0,182.161910,182.435230,184.879680,179.801353,27092.525892,6.487986e+08
std,0.0,165.857882,165.994905,168.082099,163.752065,24623.472099,9.550262e+08
min,6005191.0,20.900000,20.880000,21.000000,20.710000,238.000000,1.421413e+06
25%,6005191.0,47.405000,47.482500,48.222500,46.705000,10186.750000,6.203505e+07
50%,6005191.0,159.930000,159.980000,161.910000,157.875000,22491.000000,3.727192e+08
75%,6005191.0,208.500000,209.457500,212.175000,205.945000,36759.500000,7.486596e+08
max,6005191.0,800.000000,799.190000,803.500000,788.880000,406318.000000,1.066339e+10

In [203]:
result=贵州茅台['open'].unique()

In [204]:
result=贵州茅台['open'].nunique()

In [205]:
result3=贵州茅台['open'].value_counts()

In [ ]:
df=pd.DateFrame({
    "name":["A","B","C","B","C","A","C"]
})